#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <stdlib.h>

int main() {
	FILE* fp;
	char* pchA;
	char strA[] = "신창역에 도착하는 지하철 시간 \n신창도착시간      셔틀버스      노선\n   07:19            07:29     학내순환\n   07:49            07:59     학내순환\n   08:23            08:33     학내순환\n   08:45            08:55     학내순환\n   09:23            09:33     학내순환\n   09:57            10:07     학내순환\n   10:15            10:25     학내순환\n   10:43            10:53     학내순환\n   11:06            11:16       직행\n   11:37            11:47       직행\n   11:52            12:02       직행\n   12:23            12:33       직행\n   12:51            13:01       직행\n   13:26            12:36       직행\n   13:38            13:48       직행\n   13:51            14:01       직행\n   14:19            14:29       직행\n   14:34            14:34       직행\n   15:22            15:32       직행\n   16:11            16:21       직행\n   16:30            16:40       직행\n   17:09            17:19       직행\n   17:57            18:07       직행\n   18:10            18:20       직행\n   18:42            18:52       직행\n   19:05            19:15       직행\n   19:21            19:31       직행\n   19:42            19:52       직행\n   20:12            20:22       직행\n   20:47            20:57       직행\n   21:09            21:19       직행\n   21:33            21:43       직행\n   21:47            21:57       직행";

	if ((fp = fopen("bustime.txt", "w")) == NULL) {
		printf("bustime.txt 파일을 열 수 없음");
		exit(1);
	}
	pchA = strA;

	while (*pchA) {
		if (putc(*pchA, fp) == EOF) {
			printf("파일을 열 수 없음");
			exit(1);
		}
		pchA++;
	}
	fclose(fp);
}